In [1]:
import pandas as pd 
import numpy as np

C:\Users\HP\AppData\Local\Temp\ipykernel_1660\1228117823.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [3]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [4]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [5]:
df1.shape

(7, 4)

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [7]:
df1.isnull()

    Name  Marks  Gender  Email
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False  False   False  False
4  False   True   False  False
5  False  False   False  False
6  False  False   False  False

In [9]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [10]:
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [11]:
df1["Gender"].unique()#unquie can only be used on series and not on all the dataframe

array(['Male', 'Female'], dtype=object)

In [12]:
df1.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

In [13]:
df1.dropna()

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [16]:
df1.fillna(df1["Marks"].mean())

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [17]:
(df1["Marks"]>=80) & (df1["Marks"]<=90)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: Marks, dtype: bool

In [18]:
df1.sort_values(by="Marks",ascending=False)

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
5   Mittal   83.0  Female    mittal@yahoo.com
1   Aadhya    NaN  Female    aadhya@gmail.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [19]:
df1["Marks"].median()

98.0

In [20]:
def marks(x):
    return x/2

In [40]:
df1["Half Marks"]=df1["Marks"].apply(marks)
#creating a mew column 
print(df1)

      Name  Marks  Gender              Email  Half Marks
0  Priyang   98.0    Male  priyang@gmail.com        49.0
2   Krisha   99.0  Female   krisha@gmail.com        49.5
3   Vedant   87.0    Male   vedant@yahoo.com        43.5
5   Mittal   83.0  Female   mittal@yahoo.com        41.5
6  Archana   99.0  Female  archana@yahoo.com        49.5

In [41]:
print(df1)
df1.drop("Half Marks",axis=1,inplace=True)
df1.dropna(inplace=True)
df1

      Name  Marks  Gender              Email  Half Marks
0  Priyang   98.0    Male  priyang@gmail.com        49.0
2   Krisha   99.0  Female   krisha@gmail.com        49.5
3   Vedant   87.0    Male   vedant@yahoo.com        43.5
5   Mittal   83.0  Female   mittal@yahoo.com        41.5
6  Archana   99.0  Female  archana@yahoo.com        49.5

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [42]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)

data=pd.DataFrame({'Name':'Anil','Marks':90,'Gender':'Male','Email':'anil@gmail.com'}, index=[0])

In [43]:
a=pd.concat([df1,data],ignore_index=True)

In [44]:
a

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com
7     Anil   90.0    Male      anil@gmail.com

In [45]:
df1.loc[:,"Marks":"Gender"]

   Marks  Gender
0   98.0    Male
1    NaN  Female
2   99.0  Female
3   87.0    Male
4    NaN    Male
5   83.0  Female
6   99.0  Female

In [46]:
df1.iloc[1,2]

'Female'

In [50]:
df1.groupby('Gender')["Marks"]